src/cf/AccumulationRegisters/НДСАвансыПоДоговорамКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НДСАвансыПоДоговорамКомиссии</Name>
			<Comment>НДС авансы по договорам комиссии</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комиссионер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/НДСАвансыПоДоговорамКомиссии/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Установка исключительной блокировки текущего набора записей регистратора.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НДСАвансыПоДоговорамКомиссии.НаборЗаписей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Отбор.Регистратор.Значение);
	Блокировка.Заблокировать();
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияНДСАвансыПоДоговорамКомиссииИзменение") ИЛИ
		СтруктураВременныеТаблицы.Свойство("ДвиженияНДСАвансыПоДоговорамКомиссииИзменение") И НЕ СтруктураВременныеТаблицы.ДвиженияНДСАвансыПоДоговорамКомиссииИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	НДСАвансыПоДоговорамКомиссии.НомерСтроки КАК НомерСтроки,
		|	НДСАвансыПоДоговорамКомиссии.Комиссионер КАК Комиссионер,
		|	НДСАвансыПоДоговорамКомиссии.СчетФактура КАК СчетФактура,
		|	НДСАвансыПоДоговорамКомиссии.СтавкаНДС КАК СтавкаНДС,
		|	НДСАвансыПоДоговорамКомиссии.Покупатель КАК Покупатель,
		|	НДСАвансыПоДоговорамКомиссии.ДатаСобытия КАК ДатаСобытия,
		|	ВЫБОР
		|		КОГДА НДСАвансыПоДоговорамКомиссии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА НДСАвансыПоДоговорамКомиссии.СуммаБезНДС 
		|		ИНАЧЕ -НДСАвансыПоДоговорамКомиссии.СуммаБезНДС 
		|	КОНЕЦ КАК КоличествоПередЗаписью,
		|	НДСАвансыПоДоговорамКомиссии.Организация КАК Организация
		|ПОМЕСТИТЬ ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью
		|ИЗ
		|	РегистрНакопления.НДСАвансыПоДоговорамКомиссии КАК НДСАвансыПоДоговорамКомиссии
		|ГДЕ
		|	НДСАвансыПоДоговорамКомиссии.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.Комиссионер КАК Комиссионер,
		|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.СчетФактура КАК СчетФактура,
		|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.СтавкаНДС КАК СтавкаНДС,
		|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.Покупатель КАК Покупатель,
		|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.ДатаСобытия КАК ДатаСобытия,
		|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.СуммаБезНДС КАК КоличествоПередЗаписью,
		|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.Организация КАК Организация
		|ПОМЕСТИТЬ ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью
		|ИЗ
		|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение КАК ДвиженияНДСАвансыПоДоговорамКомиссииИзменение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НДСАвансыПоДоговорамКомиссии.НомерСтроки,
		|	НДСАвансыПоДоговорамКомиссии.Комиссионер,
		|	НДСАвансыПоДоговорамКомиссии.СчетФактура,
		|	НДСАвансыПоДоговорамКомиссии.СтавкаНДС,
		|	НДСАвансыПоДоговорамКомиссии.Покупатель,
		|	НДСАвансыПоДоговорамКомиссии.ДатаСобытия,
		|	ВЫБОР
		|		КОГДА НДСАвансыПоДоговорамКомиссии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА НДСАвансыПоДоговорамКомиссии.СуммаБезНДС
		|		ИНАЧЕ -НДСАвансыПоДоговорамКомиссии.СуммаБезНДС
		|	КОНЕЦ,
		|	НДСАвансыПоДоговорамКомиссии.Организация
		|ИЗ
		|	РегистрНакопления.НДСАвансыПоДоговорамКомиссии КАК НДСАвансыПоДоговорамКомиссии
		|ГДЕ
		|	НДСАвансыПоДоговорамКомиссии.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияНДСАвансыПоДоговорамКомиссииИзменение") Тогда
		
		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияНДСАвансыПоДоговорамКомиссииИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияНДСАвансыПоДоговорамКомиссииИзменение");
	
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.НомерСтроки) КАК НомерСтроки,
	|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.Комиссионер КАК Комиссионер,
	|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.СчетФактура КАК СчетФактура,
	|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.СтавкаНДС КАК СтавкаНДС,
	|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.Покупатель КАК Покупатель,
	|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.ДатаСобытия КАК ДатаСобытия,
	|	СУММА(ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.КоличествоПередЗаписью) КАК КоличествоПередЗаписью,
	|	СУММА(ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.КоличествоИзменение) КАК КоличествоИзменение,
	|	СУММА(ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.КоличествоПриЗаписи) КАК КоличествоПриЗаписи,
	|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.Организация КАК Организация
	|ПОМЕСТИТЬ ДвиженияНДСАвансыПоДоговорамКомиссииИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью.НомерСтроки КАК НомерСтроки,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью.Комиссионер КАК Комиссионер,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью.СчетФактура КАК СчетФактура,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью.СтавкаНДС КАК СтавкаНДС,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью.Покупатель КАК Покупатель,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью.ДатаСобытия КАК ДатаСобытия,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью.КоличествоПередЗаписью КАК КоличествоПередЗаписью,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью.КоличествоПередЗаписью КАК КоличествоИзменение,
	|		0 КАК КоличествоПриЗаписи,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью.Организация КАК Организация
	|	ИЗ
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью КАК ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи.НомерСтроки,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи.Комиссионер,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи.СчетФактура,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи.СтавкаНДС,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи.Покупатель,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи.ДатаСобытия,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи.СуммаБезНДС
	|			ИНАЧЕ ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи.СуммаБезНДС
	|		КОНЕЦ,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи.СуммаБезНДС,
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи.Организация
	|	ИЗ
	|		РегистрНакопления.НДСАвансыПоДоговорамКомиссии КАК ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи
	|	ГДЕ
	|		ДвиженияНДСАвансыПоДоговорамКомиссииПриЗаписи.Регистратор = &Регистратор) КАК ДвиженияНДСАвансыПоДоговорамКомиссииИзменение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.Комиссионер,
	|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.СчетФактура,
	|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.СтавкаНДС,
	|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.Покупатель,
	|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.ДатаСобытия,
	|	ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДвиженияНДСАвансыПоДоговорамКомиссииИзменение.КоличествоИзменение) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Комиссионер,
	|	СчетФактура,
	|	СтавкаНДС,
	|	Покупатель,
	|	ДатаСобытия,
	|	Организация");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураВременныеТаблицы.Вставить("ДвиженияНДСАвансыПоДоговорамКомиссииИзменение", НЕ РезультатЗапроса.Пустой());
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияНДСАвансыПоДоговорамКомиссииПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	
КонецПроцедуры // ПриЗаписи()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
